import 'package:facebook_app_events/facebook_app_events.dart';
import 'package:flutter/material.dart';

import '../utils/SizeConfig.dart';
import 'ShayariDetailPage.dart';

class ShayariList extends StatefulWidget {
  @override
  _ShayariListState createState() => _ShayariListState();
}

class _ShayariListState extends State<ShayariList> {
  static final facebookAppEvents = FacebookAppEvents();
  var data = [
    "भगवान कृष्ण आपके घर आएं,\nकृष्णा जन्माष्टमी की ढेर सारी शुभकामनाएं।\nKrishna Janmashtami Shayari in Hindi",
    "जन्माष्टमी के इस अवसर पर, हम ये कामना करते हैं कि श्री कृष्ण की कृपा आप पर, और आपके पूरे परिवार पर हमेशा बनी रहे। शुभ जन्मआष्टमी |",
    "कृष्णा जिसका नाम है , गोकुल जिसका धाम है , ऐसे भगवन को हम सब का परनाम है. कृष्णा जन्माष्टमी की हार्दिक शुभकामनाये",
    "श्री कृष्ण जन्माष्टमी मंगलमय हो, ओम नमो भगवते वासुदेवाय, जय हो श्री राधे जय हो श्री कृष्ण, हैप्पी जन्माष्टमी.",
    "माखन चोर नन्द किशोर,बांधी जिसने प्रीत की डोर. हरे कृष्ण हरे मुरारी,पूजती जिन्हें दुनिया सारी, आओ उनके गुण गाएं सब मिल के जन्माष्टमी मनाये.",
    "बांके बिहारी का नाम लो सहारा मिलेगा,\nये जीवन न तुमको दुबारा मिलेगा,\nडूब रही अगर कश्ती मझधार में,\nकृष्णा के नाम से सहारा मिलेगा.\nHappy Janmashtami",
    "गोकुल में जो करें निवास,\nगोपियों संग जो रचाएँ रास,\nदेवकी-यशोदा हैं जिनकी मैया,\nऐसे ही हमारे कृष्ण कन्हैया.\nजय श्री कृष्ण\nHappy Krishna Janmashtami",
    "भगवान् श्री कृष्ण स्वयं आप के घर आये,\nआप ख़ुशी से दिए जलाये,\nइस महोत्सव को आप बड़े धूम-धाम से मनाएँ,\nहमारी तरफ से कृष्ण जन्मोत्सव की ढेर सारी शुभकामनाएँ.\nहैप्पी जन्माष्टमी (Happy Janmashtami)",
    "આ સ્નાન કરી શકો છો તમે પ્રેમ અને શાંતિના ફૂલો ભગવાન કૃષ્ણની દૈવી કૃપા આજે અને હંમેશાં તમારી સાથે રહો હેપી કૃષ્ણ જન્માષ્ટમી!",
    "श्री कृष्ण के कदम आपके घर आये, आप खुशियो के दीप जलाये, परेशानी आपसे आँखे चुराए, कृष्ण जन्मोत्सव की आपको शुभकामनायें . हैप्पी जन्माष्टमी",
    "It is very obvious that truth will always win, So always try to do the things told by Lord Krishna. And behave like Lord Rama. Wish you a very Happy Janmashtami.",
    "If things are happening according to your wish you are lucky. But if not, it’s happening according to Krishna’s wish, Hare Krishna. Happy Janmashtami!",
    "राधा की चाहत है कृष्णा, उसके दिल की विरासत है कृष्णा, चाहें कितना भी रास रचा ले कृष्णा, दुनिया तो फिर भी कहती है, राधे-कृष्णा, राधे-कृष्णा।",
    "माखन का कटोरा, मिश्री का थाल, मिट्टी की खुशबू, बारिश की फुहार, राधा की उम्मीदे, कृष्ण का प्यार, मुबारक हों आपको, जन्माष्टमी का त्यौहार।",
    "કૃષ્ણ સર્વોચ્ચ ભગવાન છે, દેવકીના પુત્ર (કાન્સની બહેન) અને વાસુદેવ તે કાન્સ અને ચાનુરનો કાવતરાખોર છે હું નમન કરું છું તેમની કૃપા સાથે હંમેશા એક બ્લેસિડ કૃષ્ણ જન્માષ્ટમી છે!",
    "बचपन में बड़े नटखट, जो चुराए मिश्री और माखन,\nऐसे भगवान् को मेरे सच्चे दिल से नमन.\nजन्माष्टमी की शुभकामनाएँ",
    "राधा के दिल में कृष्ण,\nराधा के साँसों में कृष्ण,\nचाहे कितना भी रास रचे कृष्ण,\nलोग तो बस यही कहेंगे – “राधे कृष्ण राधे कृष्ण”\nकृष्ण जन्मोत्सव की ढेर सारी शुभकामनाएँ. (Krishna Janmotsav Ki Dher Saaree Shubh Kaamanayen)",
    "मेरे तो एक ही गिरधर गोपाल दूजा न कोई,\nजाके सर मोर मुकुट है, मोरे प्रभु सोई.\nकृष्ण जन्माष्टमी की शुभ कामनाएँ",
    "नन्द के घर आनंद भयो जय कन्हैया लाल की,\nहाथी, घोड़ा, पालकी जय कन्हैया लाल की.\nकृष्ण जन्माष्टमी की शुभ कामनाएँ",
    "माखन मिशरी चुरा कर जिसने खाया,\nगोपियों के संग जिसने रास रचाया,\nख़ुशी मनाओ उनके जन्मोत्सव की,\nजिसने मुरली बजा कर सबको नचाया,\nजिसने पूरी दुनिया को प्रेम का पाठ पढाया.",
    "जय हो कृष्ण कन्हैया की.\nकृष्ण जन्माष्टमी की हार्दिक शुभकामनाएँ",
    "कण-कण में है वो, जीवन के हर रंग में है वो,\nअंग-अंग में हैं वो, हर व्यक्ति के संग में हैं वो.\nकृष्ण जन्माष्टमी की हार्दिक शुभकामनाएँ",
    "जो नटखट, जो सबसे प्यार हैं वो कृष्णा हैं,\nजिसकी दिवानी बृज की हर बाला हैं वो कृष्णा हैं,\nहैप्पी जन्माष्टमी",
    "आपके घर में भी हो शोर,\nजब माखन खा ले, माखन चोर.",
    "जय हो नन���द के लाल की\nहैप्पी जन्माष्टमी",
    "गोकुल में जो करे निवास, गोपियों संग जो रचाये रास, देवकी-यशोदा जिनकी मैया, ऐसे हमारे किसन कन्हैया।",
    "A gift is pure when it is given from the heart to the right person at the right time and the right place,and when we expect noghing in return. Bhagavad Gita.",
    "जो सबको राह दिखाते और सबकी बिगड़ी बनाते हैं,\nहम तो ऐसे कृष्ण-कन्हैया का गुणगान गाते हैं.\nहैप्पी जन्माष्टमी (Happy Janmashtami)",
    "विश्व को मोहमई महिमा के असंख्य स्वरूप दिखा गया कान्हा,\nसारथी तो कभी प्रेमी बना, तो कभी गुरू-धर्म निभा गया कान्हा,\nरूप विराट धरा तो, धरा तो धरा हर लोक पे छा गया कान्हा,\nरूप किया लघु तो इतना के यशोदा की गोद में आ गया कान्हा.",
    "हमें चिंता नहीं उनकी, उन्हें चिंता हमारी हैं,\nहमारे प्राण के रक्षक सुर्दशन चक्रधारी हैं.",
    "चंदन की ख़ुशबू को रेशम का हार,\nसावन की सुगंध और बारिश की फुहार,\nराधा की उम्मीद को कन्हैया का प्यार,\nमुबारक हो आपको जन्माष्टमी का त्यौहार.\nHappy Krishna Janmashtami",
    "मिश्री से मीठे नन्द लाल के बोल,\nइनकी बातें हैं सबसे अनमोल,\nजन्माष्टमी के इस पावन अवसर पर,\nदिल खोल के जय श्री कृष्ण बोल.\nHappy Krishna Janmashtami",
    "सोचा किसी अपने से बात करें,\nअपने किसी खास को याद करें,\nकिया जो फैसला जन्माष्टमी की शुभकामना देने का,\nदिल ने कहा क्यों न आपसे शुरूआत करें.\nHappy Krishna Janmashtami",
    "हो काल-गति से परे चिरंतन अभी वहाँ थे, अभी यहाँ हो,\nकभी धरा पर, कभी गगन में, कभी कहाँ थे, कभी कहाँ हो,\nतुम्हारी राधा को भान हैं तुम सकल चराचर में हो समायें,\nबस एक मेरा हैं भाग्य मोहन कि जिसमें हो कर भी तुम नही हो.",
    "आओ मिलकर सजाये नन्दलाल को, आओ मिलकर करें उनका गुणगान! जो सबको राह दिखाते हैं, और सबकी बिगड़ी बनाते हैं! शुभ जन्मआष्ट्मी!",
    "श्री कृष्ण के कदम आपके घर आये, आप खुशियो के दीप जलाये, परेशानी आपसे आँखे चुराए, कृष्ण जन्मोत्सव की आपको शुभकामनायें . हैप्पी जन्माष्टमी",
    "माखन चोर नन्द किशोर,बांधी जिसने प्रीत की डोर. हरे कृष्ण हरे मुरारी,पूजती जिन्हें दुनिया सारी, आओ उनके गुण गाएं सब मिल के जन्माष्टमी मनाये.",
    "मेरा आपकी कृपा से, सब काम हो रहा है, करते हो तुम कन्हैया, मेरा नाम हो रहा है पतवार के बिना हे, मेरी नाव चल रही है, बस होता रहे हमेशा, जो कुछ भी हो रहा हैं !",
    "कृष्णा तेरी गलियों का जो आनंद है, वो दुनिया के किसी कोने में नहीं । जो मजा तेरी वृंदावन की रज में है, मैंने पाया किसी बिछौने में नहीं ।।",
    "कृष्णा जिसका नाम है , गोकुल जिसका धाम है , ऐसे भगवन को हम सब का परनाम है. कृष्णा जन्माष्टमी की हार्दिक शुभकामनाये",
    "प्रेम से श्री कृष्ण का नाम जपो, दिल की हर इच्छा पूरी होगी, कृष्ण आराधना में लीन हो जाओ, उनकी महिमा जीवन खुशहाल कर देगी।",
    "पलकें झुकें , और नमन हो जाए…….!! मस्तक झुके, और वंदन हो जाए……!! ऐसी नज़र, कंहाँ से लाऊँ, मेरे कन्हैया कि आपको याद करूँ और आपके दर्शन हो जाए..!!",
    "जय श्री कृष्ण! मंगल मूरत आपकी कृपा अपरम्पार; ऐसे श्री कृष्ण जी को, हम सबका नमस्कार!",
    "कृष्ण तुम पर क्या लिखूं,कितना लिखूं,\nरहोगे फिर भी आप अपरिभाषित चाहे जितना लिखूं.",
    "जग में सुंदर है दो नाम,\nचाहे कृष्ण कहो या राम.",
    "Makhan choor hai jis ka naam Bansi bajana hai jisne kaam Khushi manao uske janamdin ki Jisne duniya ko Prem shikhaya.HAPPY JANMASATMI…!",
    "जन्माष्टमी के इस अवसर पर , हम ये कामना करते हैं कि श्री कृष्ण की कृपा आप पर, और आपके पूरे परिवार पर हमेशा बनी रहे। शुभ जन्मआष्टमी!",
    "प्रेम से श्री कृष्ण का नाम जपो, दिल की हर इच्छा पूरी होगी, कृष्ण आराधना में लीन हो जाओ, उनकी महिमा जीवन खुशहाल कर देगी।",
    "नंदांचे घर आनंद भोयो, जोंग नंद यांचे घर गोपाळ गायू, जय हो मुरलीधर गोपाल की, जय हो कन्हैया लाल की",
    "कृष्णा आपल्या गल्लीचा आनंद आहे, तो जगाच्या कोणत्याही कोप-यात नाही वृंदावनच्या राज्यात आपल्यास मजा आहे, मला काहीच बेड सापडले नाही जय श्रीकृष्णा",
    "नन्द के घर आनन्द भयो, जो नन्द के घर गोपाल गयो, जय हो मुरलीधर गोपाल की, जय हो कन्हैया लाल की।",
    "कृष्णा तेरी गलियों का जो आनंद है, वो दुनिया के किसी कोने में नहीं । जो मजा तेरी वृंदावन की रज में है, मैंने पाया किसी बिछौने में नहीं ।। जय श्री कृष्णा",
    "माखन चुराकर जिसने खाया, बंसी बजाकर जिसने नचाया, ख़ुशी मनाओ उसके जन्मदिन की, जिसने दुनिया को प्रेम का पाठ पढ़ाया।",
    "तुम्हें ये जग ढूंढता है कान्हा,\nमगर इसे ये खबर नहीं है,\nबस एक मेरे है भाग्य मोहन,\nअगर कहीं हो तो तुम यहीं हो.",
    "माखन चोर नन्द किशोर,\nबांधी जिसने प्रीत की डोर,\nहरे कृष्ण हरे मुरारी,\nपूजती जिन्हें दुनिया सारी,\nआओ उनके गुण गायें,\nसब मिल के जन्माष्टमी मनायें.",
    "हार के श्याम को जीत गयी अनुराग का अर्थ बता गयी राधा,\nपीर पे पीर सहीं पर प्यार को शाश्वत कीर्ति दिला गयी राधा.",
    "न द्वारका में मिले विराजे, बिरज की गलियों में भी नही हो,\nन योगियों के हो ध्यान में तुम, अहं जड़े ज्ञान में नही हो,\nतुम्हें ये जग ढूढ़ता है मोहन, मगर इसे ये ख़बर नही हैं,\nबस एक मेरा है भाग्य मोहन, अगर कहीं हो तो तुम यही हो.",
    "माखन चुराकर जिसने खाया,\nबंसी बजाकर जिसने नचाया,\nख़ुशी मनाओ उनके जन्म दिन की,\nजिन्होंने दुनिया को प्रेम का रास्ता दिखाया.\nKrishna Janmashtami Shayari in Hindi",
    "छोड़ा सबका दामन हठयोग में तुम्हारे,\nमेरी साँसे उखड़ रही वियोग में तुम्हारे,\nलौट आओ मोहने किस बात पे अड़े हो,\nमूर्त बनकर बस मंदिर में क्यों खड़े हो.",
    "मुरली मनोहर कृष्ण कन्हैया,\nजमुना के तट पे विराजे हैं,\nमोर मुकुट पर कानों में कुंडल,\nकर में मुरलिया साजे हैं…\nWishing you a Happy and Blessed Janmashtami",
    "मुरलीधर जिसका नाम गोकुल जिसका धाम,\nऐसे श्री गोपाला को हम सब करें प्रणाम.\nHappy Krishna Janmashtami",
    "राधा की भक्ति, मुरली की मिठास,\nमाखन का स्वाद और गोपियों का रास,\nसब मिलके बनाता हैं जन्माष्टमी का दिन ख़ास.\nHappy Janmashtami"
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "Shayari List",
          style: Theme.of(context).appBarTheme.textTheme.headline1,
        ),
      ),
      body: SafeArea(
        child: data != null
            ? ListView.builder(
                itemBuilder: (context, index) {
                  return GestureDetector(
                    child: Padding(
                      padding:
                          EdgeInsets.all(1.93 * SizeConfig.widthMultiplier),
                      child: Column(
                        children: <Widget>[
                          Container(
                            decoration: BoxDecoration(
                                border: Border.all(
                                  color: Colors.red,
                                ),
                                borderRadius:
                                    // 40 / 8.96 = 4.46
                                    BorderRadius.all(Radius.circular(
                                        4.46 * SizeConfig.widthMultiplier))),
                            child: ListTile(
                              leading: Icon(
                                Icons.brightness_1,
                                color: Theme.of(context).iconTheme.color,
                              ),
                              title: Text(
                                data[index],
                                maxLines: 2,
                                style: Theme.of(context).textTheme.bodyText1,
                              ),
                              trailing: Icon(Icons.arrow_forward_ios),
                            ),
                          ),
                        ],
                      ),
                    ),
                    onTap: () {
                      Navigator.push(
                          context,
                          new MaterialPageRoute(
                              builder: (context) =>
                                  ShayariDetailPage(data[index], index)));

                      facebookAppEvents.logEvent(
                        name: "Shayari List",
                        parameters: {
                          'clicked_on_shayari_index': '$index',
                        },
                      );
                    },
                  );
                },
                itemCount: data.length,
              )
            : Center(
                child: CircularProgressIndicator(),
              ),
      ),
    );
  }
}
